<html><head><title>BeHappy Dokument&aacute;ci&oacute;</title></head>
<body bgcolor=#c0c0c0>
<center><img src="logo.jpeg"></center>
<h6 align="center"><center>
    <a href="index.html">Vissza a tartalomhoz</a> 
  </center></h6>
<hr>
<!DK><!no><!DK>
<h1 align="center">A BeHappy haszn&aacute;lata</h1>
<hr>
<p>Az els&otilde; dolog amire sz&uuml;ks&eacute;g van, egy k&ouml;nyv megnyit&aacute;sa. 
  Ehhez a k&ouml;nyv men&uuml;ben sz&uuml;ks&eacute;ges kiv&aacute;lasztani egyet 
  a az ott l&eacute;v&otilde; elemek k&ouml;z&uuml;l. A k&ouml;nyv bevezet&otilde;je 
  vagy &ouml;sszegz&eacute;se megjelenik az ablakban &eacute;s bal oldalon megjelenik 
  a BeHappy ir&aacute;ny&iacute;t&oacute;pultja.<br>
  <br>

<p>
  <center>
    <img src="2ui1.gif"> 
  </center>
  <br>
<p>A fels&otilde; men&uuml;b&otilde;l kiv&aacute;laszthatja, milyen indexel&eacute;s 
  alapj&aacute;n rendezze a tartalomjegyz&eacute;ket. A BeBook-kal 4 index alapj&aacute;n 
  lehet:
<ul>
  <li><b> Kit alapj&aacute;n</b> 
  <li><b>Kapcsolatok alapj&aacute;n</b> 
  <li><b>Funkci&oacute;k alapj&aacute;n</b> 
  <li><b>C&iacute;mek alapj&aacute;n</b>
</ul>
Valamelyik t&iacute;pust v&aacute;lasztva, a kin&eacute;zete a list&aacute;knak 
megv&aacute;ltozik . A k&ouml;vetkez&otilde; t&iacute;pus&uacute; list&aacute;k 
lehetnek ezer: 
<table border=1><tr>
    <td><b>Egyszer&ucirc; lista</b><br>
      Csak v&aacute;lasszon egy elemet a list&aacute;r&oacute;l.</td>
    <td><b>Dupla list</b>a<br>
      V&aacute;lsszon egy elemet a fels&otilde; list&aacute;r&oacute;l, ami r&eacute;szletesebben 
      jelenik meg az als&oacute; list&aacute;n. Az als&oacute; list&aacute;r&oacute;l 
      t&ouml;rt&eacute;n&otilde; v&aacute;laszt&aacute;s ut&aacute;n megjelenik 
      a megfelel&otilde; sz&ouml;veg az ablakban.</td>
    <td> 
      <p><b>Lista<br>
        </b>&Iacute;rjon valamit az als&oacute; mez&otilde;be, &eacute;s minden 
        elem megjelenik, ami azzal kezd&otilde;dik, amit be&iacute;rt.</p>
      </td>
    <td><b>"Tartalmazza" opci&oacute;</b><br>
      Ha ez az opci&oacute; ki van v&aacute;lasztva, akkor minden megjelenik, 
      ami tartalmazza a keresett sz&ouml;veget..</td>
</tr>
<tr>
<td><img src="2ui2.gif"></td>
<td><img src="2ui3.gif"></td>
<td><img src="2ui4.gif"></td>
<td><img src="2ui5.gif"></td>
</tr>
<tr>
<td></td>
    <td>N&eacute;ha l&aacute;that egy 'K&ouml;vetkez&otilde;' gombot. Ez megpr&oacute;b&aacute;lja 
      megkeresni m&aacute;shol is az elemet ami a fels&otilde; list&aacute;ban 
      ki lett jel&otilde;lve. Ez nagyon hasznos azokn&aacute;l az oszt&aacute;lyokn&aacute;l 
      ahol t&ouml;bb sz&uuml;l&otilde;je is van egy oszt&aacute;lynak.</td>
<td></td>
<td></td>
</tr>
</table>
<br>
Ki tudja v&aacute;lasztani a BeHappy nyelv&eacute;t, a Nyelv men&uuml;pont alatt. 
Jelenleg a BeHappy angol, francia &eacute;s n&eacute;met &eacute;s magyar men&uuml;vel 
rendelkezik. Ha szeretn&eacute; le is ford&iacute;thatja magadnak. Hogy megtehesse, 
meg kell keresni a BeHappy k&ouml;nyvt&aacute;rat, &eacute;s azokban leford&iacute;tani 
az &ouml;sszes *.loc f&aacute;jlt. A f&aacute;jl angolul kommentezve van, &eacute;s 
a kommentek seg&iacute;tenek a ford&iacute;t&aacute;s&aacute;ban. term&eacute;szetesen 
az Add-On k&ouml;nyvt&aacute;rban tal&aacute;lhat&oacute; *.loc f&aacute;jlokat 
is sz&uuml;ks&eacute;ges leford&iacute;tani.<br>
<br>
<center>
  K&ouml;vetkez&otilde;: <a href="3add-ons.html">Add-On-ok</a> 
</center>
<hr>
<h6 align="center"><center>
    <a href="index.html">Vissza a tartalomhoz</a> 
  </center></h6>
</body></html>