<html>
<head>
<title>Documentation de BeHappy</title>
</head>
<body bgcolor=#c0c0c0>
<center><img src="logo.jpeg"></center>
<h6 align="center"><center><a href="index.html">Retourner au Sommaire</a></center></h6>
<hr>
<!DK><!no><!DK>
<h1 align="center">Utilisation de BeHappy</h1><hr>
<p>La premi&egrave;re chose que vous devez faire est d'ouvrir un livre. Pour cela, allez dans le menu "<b>Livre</b>" et s&eacute;lectionnez un des items.
L'introduction ou le sommaire du livre apparait dans la fen&ecirc;tre, et sur la gauche vous verrez les contr&ocirc;les de BeHappy. Voici les contr&ocirc;les du BeBook:
<br>
<center><img src="2ui1.gif"></center>
<br>
<p>Le menu d&eacute;roulant vous permet de choisir l'index que vous avez besoin d'utiliser. Avec le BeBook, vous avez quatre index:
<ul>
<li><b>Par kit</b>
<li><b>Par h&eacute;ritage</b>
<li><b>Index des fonctions</b>
<li><b>Index des sujets</b>
</ul>
S&eacute;lectionnez un index et la/les liste(s) en dessous change(nt). Vous pouvez avoir plusieurs types de listes:
<table border=1><tr>
<td><b>Liste simple</b><br>Il suffit juste de s&eacute;lectionner un item dans la liste.</td>
<td><b>Liste double</b><br>S&eacute;lectionnez un item dans la liste du haut, et plus de d&eacute;tails apparaitront dans celle du bas.
S&eacute;lectionnez un item dans la liste du bas pour afficher le texte correspondant dans la fen&ecirc;tre.</td>
<td><b>Liste avec une recherche</b><br>Tapez quelques chose dans la zone de texte du bas, et la liste va afficher tout les items qui commencent par ce que vous avez tap&eacute;.</td>
<td><b>Option "Contenant"</b><br>Avec cette option de s&eacute;lectionn&eacute;e, tout les items contenant ce que vous avez tap&eacute; sont affich&eacute;s dans la liste.</td>
</tr>
<tr>
<td><center><img src="2ui2.gif"></center></td>
<td><center><img src="2ui3.gif"></center></td>
<td><center><img src="2ui4.gif"></center></td>
<td><center><img src="2ui5.gif"></center></td>
</tr>
<tr>
<td></td>
<td>Parfois vous verrez un bouton "<b>Suivant</b>". Il recherche si l'item que vous avez s&eacute;lectionn&eacute; dans la liste du haut existe quelque part ailleurs.
C'est tr&egrave;s pratique dans l'index "<b>Par H&eacute;ritage</b>" dans le BeBook, avec les classes qui utilisent l'h&eacute;ritage multiple.</td>
<td></td>
<td></td>
</tr>
</table>
<br>
Vous pouvez choisir la langue utilis&eacute;e par BeHappy avec le menu 'Language'. Pour l'instant BeHappy peut avoir des menus en Fran&ccedil;ais, Anglais et Allemand. Vous pouvez ajouter votre propre traduction si vous voulez. Pour cela, regardez le fichier <b>BeHappy.loc</b> dans le dossier de BeHappy. Un petit mode d'emploi vous dira comment faire. Il faudra &eacute;galement &eacute;diter les fichiers <b>*.loc</b> dans le dossier <b>Add-ons</b>.
<br>
<br>
<center>Suivant: <a href="3add-ons.html">Les add-Ons</a></center>
<hr>
<h6 align="center"><center><a href="index.html">Retourner au Sommaire</h6>
</body>
</html>
